@manicminer Thanks for getting back. I have partially success with the new provider. On one environment TF could reference and maintain the resources with `No changes. Your infrastructure matches the configuration.` 

But on another one TF unfortunately wants to recreate the resources for no reason: 
```
  # azurerm_pim_eligible_role_assignment.crypto_officer must be replaced
-/+ resource "azurerm_pim_eligible_role_assignment" "crypto_officer" {
      ~ id                 = "<REDACTED>" -> (known after apply)
      + justification      = (known after apply)
      ~ principal_type     = "Group" -> (known after apply)
        # (3 unchanged attributes hidden)

      - schedule {
          - start_date_time = "2024-04-09T05:48:40.389606+00:00" -> null

          - expiration {
              - duration_days  = 0 -> null
              - duration_hours = 0 -> null
            }
        }

      - ticket {} # forces replacement
    }

Plan: X to add, 0 to change, X to destroy.
```

I have compared both states and there is no real diff except for the IDs ofcourse. The Ticket block is on both states empty.
You're help would be much appreciated. 